log.org
#+hugo_base_dir: .

#+author:
#+hugo_custom_front_matter: :author "Moritz"
# Apparently the =tale= theme doesn't like multiple authors, so we have to go through the custom front matter ...

** A Haskell Cross Compiler for Raspberry Pi
   :PROPERTIES:
   :EXPORT_FILE_NAME: 2017-05-16-a-haskell-cross-compiler-for-raspberry-pi
   :EXPORT_DATE: <2017-05-16>
   :ID:       E305F9CA-459D-491B-9A9F-73FB49E94211
   :END:

After [[https://medium.com/@zw3rk/quick-headless-raspberry-pi-setup-52ad6dd312c4][setting up our Raspberry Pi]] and [[https://medium.com/@zw3rk/raspbian-cross-compilation-toolchain-830fe56d75ba][building the raspbian SDK]]. Today
we will build a Haskell cross compiler (GHC) for the [[http://amzn.to/2pykYYv][Raspberry Pi]], to
be used together with the SDK.

We will use a custom GHC branch, as not all necessary patches have yet
landed yet in the upstream repository. Alternatively you can use the
official GHC =master= branch and apply the patches manually with =arc
patch=.

*** Prerequisites
    :PROPERTIES:
    :ID:       954D105B-4B6B-4ED6-B6AD-E12CF8753DCD
    :END:

Make sure you have a =ghc= and =cabal= installed. You can download a
recent version from [[http://downloads.haskell.org/~ghc/8.0.2/][downloads.haskell.org]]. You will also need =alex= and
=happy=:

#+BEGIN_EXAMPLE
  cabal install alex happy
#+END_EXAMPLE

This should produce =~/.cabal/bin/alex= and =~/.cabal/bin/happy=.

Due to an incompatibility between the /latest version/ of libffi (/from
2014/), and recent llvm versions, which only understand the unified arm
assembly syntax, we need to build a custom libffi version. With the
raspbian SDK's =prebuilt/bin= in =PATH= this should be as simple as:

#+BEGIN_EXAMPLE
  git clone https://github.com/libffi/libffi.git
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  cd libffi
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  ./autogen.sh
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  CC="arm-linux-gnueabihf-clang" CXX="arm-linux-gnueabihf-clang" \
          ./configure \
          --prefix=/path/to/libffi/arm-linux-gnueabihf \
          --host=arm-linux-gnueabihf \
          --enable-static=yes --enable-shared=yes
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  make && make install
#+END_EXAMPLE

This will build and place the =libffi= header and libraries into
=/path/to/libffi/arm-linux-gnueabihf=.

*** Building GHC
    :PROPERTIES:
    :ID:       4364E97F-BCFC-4562-8BB9-FC0CA6780A18
    :END:

Ensure that =ghc=, =alex=, =happy=, =cabal=, as well as your Raspbian
SDK are in your =PATH=. If not, export =PATH= appropriately:

#+BEGIN_EXAMPLE
  export PATH=$HOME/.cabal/bin:$PATH
  export PATH=/path/to/bin/ghc:$PATH
  export PATH=/path/to/raspbian-sdk/prebuilt/bin:$PATH
#+END_EXAMPLE

Next, we will obtain the patched GHC source via =git=:

#+BEGIN_EXAMPLE
  git clone --recursive git://git.haskell.org/ghc.git
  cd ghc
  git remote add zw3rk https://github.com/zw3rk/ghc.git
  git fetch zw3rk
  git checkout zw3rk/my-ghc -b my-ghc
  git submodule update --init --recursive
#+END_EXAMPLE

/Note: the custom/ =my-ghc= /branch contains a few patches
(/[[https://phabricator.haskell.org/D3352][/D3352/]]/,/
[[https://phabricator.haskell.org/D3443][/D3443/]], //
[[https://phabricator.haskell.org/D3448][/D3448/]]/,/
[[https://phabricator.haskell.org/D3502][/D3502/]]/,/
[[https://phabricator.haskell.org/D3579][/D3579/]]/,/
[[https://phabricator.haskell.org/D3591][/D3591/]]/) on top of the GHC
master branch that are not yet landed./

Building =GHC= for =arm-linux-gnueabihf= and /installing it alongside/
=clang= /in the raspbian sdk/ should require only the following now

#+BEGIN_EXAMPLE
  # set paths
  export RASPBIAN_SDK=/path/to/raspbian-sdk/
  export LIBFFI=/path/to/libffi/arm-linux-gnueabihf
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # Boot up the build system
  ./boot
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # Configure a GHC that targets the Raspberry Pi
  ./configure --target=arm-linux-gnueabihf \
              --prefix=$RASPBIAN_SDK/prebuilt \
              --with-system-libffi \
              --with-ffi-includes=$LIBFFI/include \
              --with-ffi-libraries=$LIBFFI/lib
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # Create a mk/build.mk and set the BuildFlavour to quick-cross
  sed -E "s/^#(BuildFlavour[ ]+= quick-cross)$/\1/" \
      mk/build.mk.sample > mk/build.mk
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  # Compile and install ghc
  make -j && make install
#+END_EXAMPLE

This will likely take approximately 30--60 minutes depending on your
hardware. If everything went right, you will find
=arm-linux-gnueabihf-ghc= in =/path/to/raspbian-sdk/prebuilt/bin=.

We will wrap up by trying out our brand new Haskell cross compiler.

*** Compiling =Hello World=
    :PROPERTIES:
    :ID:       70E76339-446A-4BE6-B313-49EC2FCD1813
    :END:

Let us create a very simple =Hello.hs= similar to the =hello.c= we
created when trying out =clang= from the SDK's toolchain.

#+BEGIN_EXAMPLE
  module Main where
#+END_EXAMPLE

#+BEGIN_EXAMPLE
  main :: IO ()
  main = putStrLn "Hello World!"
#+END_EXAMPLE

Compiling it should be as trivial as saying

#+BEGIN_EXAMPLE
  arm-linux-gnueabihf-ghc Hello.hs
#+END_EXAMPLE

Assuming that =/path/to/raspbian-sdk/prebuilt/bin= is still in your
=PATH=.

*** Running Hello World
    :PROPERTIES:
    :ID:       0A7BDB20-A828-439F-8EF9-B360C7E9B56C
    :END:

All that is left now, is to copy the binary over to the Raspberry Pi

#+BEGIN_EXAMPLE
  scp Hello pi@raspberrypi:
#+END_EXAMPLE

and executing it

#+BEGIN_EXAMPLE
  ssh pi@raspberrypi ./Hello
#+END_EXAMPLE

Next we will look at Haskell's package management with Cabal with an eye
on cross compilation.

